OpenNuvoton/M55M1BSP/Library/CryptoAccelerator/rsa_alt.c
/*
 *  The RSA public-key cryptosystem
 *
 *  Copyright The Mbed TLS Contributors
 *  SPDX-License-Identifier: Apache-2.0
 *
 *  Licensed under the Apache License, Version 2.0 (the "License"); you may
 *  not use this file except in compliance with the License.
 *  You may obtain a copy of the License at
 *
 *  http://www.apache.org/licenses/LICENSE-2.0
 *
 *  Unless required by applicable law or agreed to in writing, software
 *  distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 *  WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *  See the License for the specific language governing permissions and
 *  limitations under the License.
 */

/*
 *  The following sources were referenced in the design of this implementation
 *  of the RSA algorithm:
 *
 *  [1] A method for obtaining digital signatures and public-key cryptosystems
 *      R Rivest, A Shamir, and L Adleman
 *      http://people.csail.mit.edu/rivest/pubs.html#RSA78
 *
 *  [2] Handbook of Applied Cryptography - 1997, Chapter 8
 *      Menezes, van Oorschot and Vanstone
 *
 *  [3] Malware Guard Extension: Using SGX to Conceal Cache Attacks
 *      Michael Schwarz, Samuel Weiser, Daniel Gruss, Clémentine Maurice and
 *      Stefan Mangard
 *      https://arxiv.org/abs/1702.08719v2
 *
 */

#ifdef MBEDTLS_ALLOW_PRIVATE_ACCESS
    /* Deviation: MISRA C:2012 Rule 20.5 - #undef is required to revoke MBEDTLS_ALLOW_PRIVATE_ACCESS and enforce private struct member encapsulation in this compilation unit. */
    // cppcheck-suppress misra-c2012-20.5
    #undef MBEDTLS_ALLOW_PRIVATE_ACCESS
#endif

#include "common.h"

#if defined(MBEDTLS_RSA_C)

#include "mbedtls/rsa.h"
#include "rsa_alt_helpers.h"
#include "mbedtls/oid.h"
#include "mbedtls/platform_util.h"
#include "mbedtls/error.h"

#include <string.h>

#if defined(MBEDTLS_PKCS1_V21)
    #include "mbedtls/md.h"
#endif

#if defined(MBEDTLS_PKCS1_V15) && !defined(__OpenBSD__) && !defined(__NetBSD__)
    #include <stdlib.h>
#endif

#if defined(MBEDTLS_PLATFORM_C)
    #include "mbedtls/platform.h"
#else
    #include <stdio.h>
    #define mbedtls_printf printf
    #define mbedtls_calloc calloc
    #define mbedtls_free   free
#endif

#if defined(MBEDTLS_RSA_ALT)

#include "NuMicro.h"

/* Parameter validation macros */
#define RSA_VALIDATE_RET( cond )                                       \
    MBEDTLS_INTERNAL_VALIDATE_RET( cond, MBEDTLS_ERR_RSA_BAD_INPUT_DATA )
#define RSA_VALIDATE( cond )                                           \
    MBEDTLS_INTERNAL_VALIDATE( cond )

#if (NVT_DCACHE_ON == 1)
    // DCache-line aligned buffer for improved performance when DCache is enabled
    uint8_t rsa_buf[DCACHE_ALIGN_LINE_SIZE(128)] __attribute__((aligned(DCACHE_LINE_SIZE)));
#else
    // Standard buffer alignment when DCache is disabled
    __attribute__((aligned(4))) static uint8_t rsa_buf[128];
#endif

int RSA_Run(void);
void rsa_dma_buf_init(mbedtls_rsa_context *ctx, mbedtls_mpi *ed);
void memcpy_be(void *dest, void *src, uint32_t size);


//
bool is_aligned_32(void *ptr)
{
    // Convert the pointer to an integer type for arithmetic operations
    uintptr_t address = (uintptr_t)ptr;

    // Check if the address is divisible by 32
    return (address % 32) == 0;
}

uint32_t *get_aligned_32(void *ptr)
{
    // Convert the pointer to an integer type for arithmetic operations
    uintptr_t address = (uintptr_t)ptr;

    uint32_t aligned_32_remainder = (address % 32);
    // Check if the address is divisible by 32

    uint32_t ttmp = (uint32_t)(ptr) - aligned_32_remainder + 32;
#ifdef DUMP_RSA_CACHEALIGNMENT
    printf("ptr Allocate from  heap at (0x%x)\r\n", (ptr));
    printf("aligned_32_remainder :%d \r\n", aligned_32_remainder);
    printf("ttmp = (0x%x)\r\n", ttmp);
#endif
    return (uint32_t *)(ttmp);
}

uint32_t heap_cache_aligned_32_handler(void *ptr, uint32_t len, nvt_heap_aligned_descriptor *rdesp)
{
    uint32_t res = 0;
    memset(rdesp, 0, sizeof(nvt_heap_aligned_descriptor));

    // Check address alignment
    if (is_aligned_32((ptr)) == true)
    {
        if (is_aligned_32((void *)(len)) == true)
        {
            //Length alignment
            res = 0;
            rdesp->type_aligned = 0;
            rdesp->uplen = &len;
            rdesp->vptr = ptr;
            rdesp->uplen_aligned = &len;
            rdesp->vptr_aligned = ptr;
        }
        else
        {
            //Length NOT alignment
            res = 1;
            rdesp->type_aligned = 1;
            rdesp->uplen = &len;
            rdesp->uplen_aligned = get_aligned_32((void *)(rdesp->uplen));

            rdesp->vptr = (uint32_t *)calloc(*(rdesp->uplen_aligned) + DCACHE_LINE_SIZE, sizeof(uint32_t));
            rdesp->vptr_aligned = rdesp->vptr;

            memcpy(rdesp->vptr_aligned, rdesp->vptr, *(rdesp->uplen_aligned));
        }
    }
    else//Not address alignment
    {


        if (is_aligned_32((void *)(len)) == true)
        {
            res = 2;
            rdesp->type_aligned = 2;
            //Length alignment
            rdesp->uplen = &len;
            rdesp->uplen_aligned = &len;
            rdesp->vptr = (uint32_t *)calloc(*(rdesp->uplen) + DCACHE_LINE_SIZE, sizeof(uint32_t));
            rdesp->vptr_aligned = get_aligned_32((void *)(rdesp->vptr));
#ifdef DBG_RSA_CACHEALIGNMENT

            for (int ii = 0; ii < len; ii++)
            {
                printf("%x,\r\n", *((uint32_t *)(ptr++)));
            }

#endif

            memcpy((uint8_t *)(rdesp->vptr_aligned), (uint8_t *)(ptr), (*(rdesp->uplen_aligned)) * 4);
#ifdef DBG_RSA_CACHEALIGNMENT

            for (int jj = 0; jj < * (rdesp->uplen_aligned) * 4; jj++)
            {
                *(uint8_t *)(rdesp->vptr_aligned++) = *((uint8_t *)(ptr++));
            }

            for (int jj = 0; jj < * (rdesp->uplen_aligned); jj++)
            {
                printf("%x, \r\n", *(uint32_t *)(rdesp->vptr_aligned++));
            }

#endif
        }
        else
        {
            res = 3;
            rdesp->type_aligned = 3;
            //Length NOT alignment
            rdesp->uplen = &len;
            rdesp->uplen_aligned = get_aligned_32((void *)(rdesp->uplen));
            rdesp->vptr = (uint32_t *)calloc(*(rdesp->uplen_aligned) + DCACHE_LINE_SIZE, sizeof(uint32_t));
            rdesp->vptr_aligned = get_aligned_32((void *)(rdesp->vptr));
            memcpy(rdesp->vptr_aligned, rdesp->vptr, *(rdesp->uplen_aligned));
        }

