OpenNuvoton/M55M1BSP/Library/CryptoAccelerator/rsa_alt.c
    }

#ifdef DUMP_RSA_CACHEALIGNMENT
    printf("Aligned type is %d\r\n",  rdesp->type_aligned);
    printf("Allocate a heap at (0x%x), length is %d\r\n", (ptr), len);
    printf("Aligned    heap to (0x%x), length to %d\r\n", (rdesp->vptr), *(rdesp->uplen));
    printf("Fit        heap to (0x%x), length to %d\r\n", (rdesp->vptr_aligned), *(rdesp->uplen_aligned));
#endif
    return res;

}


uint32_t heap_cache_aligned_32_free(nvt_heap_aligned_descriptor *rdesp)
{
    uint32_t res;

    switch (rdesp->type_aligned)
    {
        case 0:
            //printf("address alignment, length alignment\n");
            res = 0;
            break;

        case 1:
        case 2:
        case 3:
            res = rdesp->type_aligned;
            //printf("cache aligned, case %d\n", res);
            free(rdesp->vptr);
            break;

        default:
            //printf("Wrong aligned type\n");
            res = 0x0F;
            break;
    }

    return res;
}
//

int RSA_Run(void)
{
    uint32_t timeout = 2000000000;

    /* Clear RSA flag */
    CRYPTO->INTSTS = CRYPTO_INTSTS_RSAIF_Msk;;

    /* Start RSA */
    CRYPTO->RSA_CTL |= CRYPTO_RSA_CTL_START_Msk;

    /* Waiting for RSA operation done */
    while ((CRYPTO->INTSTS & CRYPTO_INTSTS_RSAIF_Msk) == 0)
    {
        if (timeout-- == 0)
        {
            return (-1);
        }
    }

    return (0);
}

nvt_heap_aligned_descriptor heap_sr_0, heap_sr_1, heap_sr_2;

void rsa_dma_buf_init(mbedtls_rsa_context *ctx, mbedtls_mpi *ed)
{
    uint32_t res;

    mbedtls_mpi_grow(ed, ctx->MBEDTLS_PRIVATE(len));
    mbedtls_mpi_grow(&ctx->M, ctx->MBEDTLS_PRIVATE(len));
    mbedtls_mpi_grow(&ctx->MBEDTLS_PRIVATE(N), ctx->MBEDTLS_PRIVATE(len));

#if (NVT_DCACHE_ON == 1)

#ifdef DBG_RSA_CACHEALIGNMENT
    printf("mbedtls_mpi_grow 1:\r\n");
    printf("(ctx->M.MBEDTLS_PRIVATE(p))= 0x%x\n", (ctx->M.MBEDTLS_PRIVATE(p)));
    printf("(ctx->M.MBEDTLS_PRIVATE(n))= %d\n", (ctx->M.MBEDTLS_PRIVATE(n)));

    printf("mbedtls_mpi_grow 2:\r\n");
    printf("(ctx->MBEDTLS_PRIVATE(N).MBEDTLS_PRIVATE(p))= 0x%x\n", (ctx->MBEDTLS_PRIVATE(N).MBEDTLS_PRIVATE(p)));
    printf("(ctx->MBEDTLS_PRIVATE(N).MBEDTLS_PRIVATE(n))= %d\n", (ctx->MBEDTLS_PRIVATE(N).MBEDTLS_PRIVATE(n)));

    printf("mbedtls_mpi_grow 3:\r\n");
    printf("(ed->MBEDTLS_PRIVATE(p))= 0x%x\n", (ed->MBEDTLS_PRIVATE(p)));
    printf("(ed->MBEDTLS_PRIVATE(n))= %d\n", (ed->MBEDTLS_PRIVATE(n)));
#endif

#ifdef MANUAL_ALIGNMENT

    res = heap_cache_aligned_32_handler((void *)(ctx->M.MBEDTLS_PRIVATE(p)), (ctx->M.MBEDTLS_PRIVATE(n)), &heap_sr_0);

    if (res)
    {
        printf("heap_cache_aligned_32 error: %d\r\n", res);
    }

    res = heap_cache_aligned_32_handler((void *)(ctx->MBEDTLS_PRIVATE(N).MBEDTLS_PRIVATE(p)), (ctx->MBEDTLS_PRIVATE(N).MBEDTLS_PRIVATE(n)), &heap_sr_1);

    if (res)
    {
        printf("heap_cache_aligned_32 error: %d\r\n", res);
    }

    res = heap_cache_aligned_32_handler((void *)(ed->MBEDTLS_PRIVATE(p)), (ed->MBEDTLS_PRIVATE(n)), &heap_sr_2);

    if (res)
    {
        printf("heap_cache_aligned_32 error: %d\r\n", res);
    }

    SCB_CleanDCache_by_Addr((void *)(heap_sr_0.vptr_aligned), *(heap_sr_0.uplen_aligned));
    SCB_CleanDCache_by_Addr((void *)(heap_sr_1.vptr_aligned), *(heap_sr_1.uplen_aligned));
    SCB_CleanDCache_by_Addr((void *)(heap_sr_2.vptr_aligned), *(heap_sr_2.uplen_aligned));

    CRYPTO->RSA_SADDR[0] = (uint32_t)(heap_sr_0.vptr_aligned);// Message
    CRYPTO->RSA_SADDR[1] = (uint32_t)(heap_sr_1.vptr_aligned);
    CRYPTO->RSA_SADDR[2] = (uint32_t)(heap_sr_2.vptr_aligned);// Public key or private key
    //printf("++Aligned sr0 heap to (0x%x), length to (%d)\r\n", (heap_sr_0.vptr_aligned), *(heap_sr_0.uplen_aligned));
    //printf("++Aligned sr1 heap to (0x%x), length to (%d)\r\n", (heap_sr_1.vptr_aligned), *(heap_sr_1.uplen_aligned));
    //printf("++Aligned sr2 heap to (0x%x), length to (%d)\r\n", (heap_sr_2.vptr_aligned), *(heap_sr_2.uplen_aligned));
#else

    SCB_CleanDCache_by_Addr((void *)(ctx->M.MBEDTLS_PRIVATE(p)), (ctx->M.MBEDTLS_PRIVATE(n)));
    SCB_CleanDCache_by_Addr((void *)(ctx->MBEDTLS_PRIVATE(N).MBEDTLS_PRIVATE(p)), (ctx->MBEDTLS_PRIVATE(N).MBEDTLS_PRIVATE(n)));
    SCB_CleanDCache_by_Addr((void *)(ed->MBEDTLS_PRIVATE(p)), (ed->MBEDTLS_PRIVATE(n)));

    CRYPTO->RSA_SADDR[0] = (uint32_t)ctx->M.MBEDTLS_PRIVATE(p);// Message
    CRYPTO->RSA_SADDR[1] = (uint32_t)ctx->MBEDTLS_PRIVATE(N).MBEDTLS_PRIVATE(p);
    CRYPTO->RSA_SADDR[2] = (uint32_t)ed->MBEDTLS_PRIVATE(p);   // Public key or private key

#endif

#else
    CRYPTO->RSA_SADDR[0] = (uint32_t)ctx->M.MBEDTLS_PRIVATE(p);// Message
    CRYPTO->RSA_SADDR[1] = (uint32_t)ctx->MBEDTLS_PRIVATE(N).MBEDTLS_PRIVATE(p);
    CRYPTO->RSA_SADDR[2] = (uint32_t)ed->MBEDTLS_PRIVATE(p);   // Public key or private key
#endif//(NVT_DCACHE_ON == 1)


    /* Initial memory space for RSA */
    CRYPTO->RSA_DADDR = (uint32_t)&rsa_buf[0];

}

void memcpy_be(void *dest, void *src, uint32_t size)
{
    uint32_t i;
    uint8_t *pu8Dest, *pu8Src;

    pu8Dest = dest;
    pu8Src = src;

    mbedtls_printf("size in memcpy_be:%d \n", size);

    for (i = 0; i < size; i++)
    {
        pu8Dest[i] = pu8Src[size - i - 1];
    }

}


#if defined(MBEDTLS_PKCS1_V15)
/* constant-time buffer comparison */
static inline int mbedtls_safer_memcmp(const void *a, const void *b, size_t n)
{
    size_t i;
    const unsigned char *A = (const unsigned char *) a;
    const unsigned char *B = (const unsigned char *) b;
    unsigned char diff = 0;

    for (i = 0; i < n; i++)
    {
        diff |= A[i] ^ B[i];
    }

    return (diff);
}
#endif /* MBEDTLS_PKCS1_V15 */

int mbedtls_rsa_import(mbedtls_rsa_context *ctx,
                       const mbedtls_mpi *N,
                       const mbedtls_mpi *P, const mbedtls_mpi *Q,
                       const mbedtls_mpi *D, const mbedtls_mpi *E)
{
    int ret = MBEDTLS_ERR_ERROR_CORRUPTION_DETECTED;
    RSA_VALIDATE_RET(ctx != NULL);

    if ((N != NULL && (ret = mbedtls_mpi_copy(&ctx->N, N)) != 0) ||
            (P != NULL && (ret = mbedtls_mpi_copy(&ctx->P, P)) != 0) ||
            (Q != NULL && (ret = mbedtls_mpi_copy(&ctx->Q, Q)) != 0) ||
            (D != NULL && (ret = mbedtls_mpi_copy(&ctx->D, D)) != 0) ||
            (E != NULL && (ret = mbedtls_mpi_copy(&ctx->E, E)) != 0))
    {
        return (MBEDTLS_ERROR_ADD(MBEDTLS_ERR_RSA_BAD_INPUT_DATA, ret));
    }

    if (N != NULL)
    {
        ctx->len = mbedtls_mpi_size(&ctx->N);
    }

    return (0);
}

int mbedtls_rsa_import_raw(mbedtls_rsa_context *ctx,
                           unsigned char const *N, size_t N_len,
                           unsigned char const *P, size_t P_len,
                           unsigned char const *Q, size_t Q_len,
                           unsigned char const *D, size_t D_len,
                           unsigned char const *E, size_t E_len)
{
    int ret = 0;
    RSA_VALIDATE_RET(ctx != NULL);

    if (N != NULL)
    {
        MBEDTLS_MPI_CHK(mbedtls_mpi_read_binary(&ctx->N, N, N_len));
        ctx->len = mbedtls_mpi_size(&ctx->N);
    }

    if (P != NULL)
    {
        MBEDTLS_MPI_CHK(mbedtls_mpi_read_binary(&ctx->P, P, P_len));
    }

    if (Q != NULL)
    {
        MBEDTLS_MPI_CHK(mbedtls_mpi_read_binary(&ctx->Q, Q, Q_len));
    }

    if (D != NULL)
    {
        MBEDTLS_MPI_CHK(mbedtls_mpi_read_binary(&ctx->D, D, D_len));
    }

    if (E != NULL)
    {
        MBEDTLS_MPI_CHK(mbedtls_mpi_read_binary(&ctx->E, E, E_len));
    }

cleanup:

    if (ret != 0)
    {
        return (MBEDTLS_ERROR_ADD(MBEDTLS_ERR_RSA_BAD_INPUT_DATA, ret));
    }

    return (0);
}

