OpenNuvoton/M55M1BSP/Library/CryptoAccelerator/rsa_alt.c
    /* output */
    memcpy_be(output, &rsa_buf[0], sizeof(rsa_buf));

    //dump(output, 32, "output");

    return 0;
}

/*
 * Do an RSA private key operation
 */
int mbedtls_rsa_private(mbedtls_rsa_context *ctx,
                        int (*f_rng)(void *, unsigned char *, size_t),
                        void *p_rng,
                        const unsigned char *input,
                        unsigned char *output)
{

    int     err;
    printf("mbedtls_rsa_private \n");

    if ((ctx->MBEDTLS_PRIVATE(len) != 128) && (ctx->MBEDTLS_PRIVATE(len) != 256) && (ctx->MBEDTLS_PRIVATE(len) != 384) && (ctx->MBEDTLS_PRIVATE(len) != 512))
    {
        return MBEDTLS_ERR_RSA_BAD_INPUT_DATA;
    }

    if (rsa_check_context(ctx, 1 /* private key checks */,
                          1 /* blinding on        */) != 0)
    {
        return (MBEDTLS_ERR_RSA_BAD_INPUT_DATA);
    }


    /* Reset Crypto */
    SYS_UnlockReg();
    SYS->CRYPTORST |= SYS_CRYPTORST_CRYPTO0RST_Msk;
    SYS->CRYPTORST = 0;
    SYS_LockReg();

    CRYPTO->RSA_CTL = RSA_MODE_NORMAL | ((ctx->MBEDTLS_PRIVATE(len) / 128 - 1) << CRYPTO_RSA_CTL_KEYLENG_Pos);

    mbedtls_mpi_init(&ctx->M);
    //mbedtls_mpi_init(&ctx->CP);
    //mbedtls_mpi_init(&ctx->CQ);

    mbedtls_mpi_read_binary(&ctx->M, input, ctx->MBEDTLS_PRIVATE(len));
    rsa_dma_buf_init(ctx, &ctx->MBEDTLS_PRIVATE(D));
    printf("RSA_Run, private \n");
    err = RSA_Run();

    if (err)
    {
        printf("RSA_Run, private err\n");
        return MBEDTLS_ERR_RSA_PRIVATE_FAILED;
    }

#if (NVT_DCACHE_ON == 1)
    SCB_InvalidateDCache_by_Addr(&rsa_buf[0], sizeof(rsa_buf));
    heap_cache_aligned_32_free(&heap_sr_0);
    heap_cache_aligned_32_free(&heap_sr_1);
    heap_cache_aligned_32_free(&heap_sr_2);
#endif
    mbedtls_mpi_free(&ctx->M);
    //mbedtls_mpi_free(&ctx->CP);
    //mbedtls_mpi_free(&ctx->CQ);

    /* Output */

    memcpy_be(output, &rsa_buf[0], sizeof(rsa_buf));


    return (0);
}


#if defined(MBEDTLS_PKCS1_V21)
/**
 * Generate and apply the MGF1 operation (from PKCS#1 v2.1) to a buffer.
 *
 * \param dst       buffer to mask
 * \param dlen      length of destination buffer
 * \param src       source of the mask generation
 * \param slen      length of the source buffer
 * \param md_ctx    message digest context to use
 */
static int mgf_mask(unsigned char *dst, size_t dlen, unsigned char *src,
                    size_t slen, mbedtls_md_context_t *md_ctx)
{
    unsigned char mask[MBEDTLS_MD_MAX_SIZE];
    unsigned char counter[4];
    unsigned char *p;
    unsigned int hlen;
    size_t i, use_len;
    int ret = 0;

    memset(mask, 0, MBEDTLS_MD_MAX_SIZE);
    memset(counter, 0, 4);

    hlen = mbedtls_md_get_size(md_ctx->md_info);

    /* Generate and apply dbMask */
    p = dst;

    while (dlen > 0)
    {
        use_len = hlen;

        if (dlen < hlen)
        {
            use_len = dlen;
        }

        if ((ret = mbedtls_md_starts(md_ctx)) != 0)
        {
            goto exit;
        }

        if ((ret = mbedtls_md_update(md_ctx, src, slen)) != 0)
        {
            goto exit;
        }

        if ((ret = mbedtls_md_update(md_ctx, counter, 4)) != 0)
        {
            goto exit;
        }

        if ((ret = mbedtls_md_finish(md_ctx, mask)) != 0)
        {
            goto exit;
        }

        for (i = 0; i < use_len; ++i)
        {
            *p++ ^= mask[i];
        }

        counter[3]++;

        dlen -= use_len;
    }

exit:
    mbedtls_platform_zeroize(mask, sizeof(mask));

    return (ret);
}
#endif /* MBEDTLS_PKCS1_V21 */

#if defined(MBEDTLS_PKCS1_V21)
/*
 * Implementation of the PKCS#1 v2.1 RSAES-OAEP-ENCRYPT function
 */
int mbedtls_rsa_rsaes_oaep_encrypt(mbedtls_rsa_context *ctx,
                                   int (*f_rng)(void *, unsigned char *, size_t),
                                   void *p_rng,
                                   const unsigned char *label, size_t label_len,
                                   size_t ilen,
                                   const unsigned char *input,
                                   unsigned char *output)
{
    size_t olen;
    int ret = MBEDTLS_ERR_ERROR_CORRUPTION_DETECTED;
    unsigned char *p = output;
    unsigned int hlen;
    const mbedtls_md_info_t *md_info;
    mbedtls_md_context_t md_ctx;

    RSA_VALIDATE_RET(ctx != NULL);
    RSA_VALIDATE_RET(output != NULL);
    RSA_VALIDATE_RET(ilen == 0 || input != NULL);
    RSA_VALIDATE_RET(label_len == 0 || label != NULL);

    if (f_rng == NULL)
    {
        return (MBEDTLS_ERR_RSA_BAD_INPUT_DATA);
    }

    md_info = mbedtls_md_info_from_type((mbedtls_md_type_t) ctx->hash_id);

    if (md_info == NULL)
    {
        return (MBEDTLS_ERR_RSA_BAD_INPUT_DATA);
    }

    olen = ctx->len;
    hlen = mbedtls_md_get_size(md_info);

    /* first comparison checks for overflow */
    if (ilen + 2 * hlen + 2 < ilen || olen < ilen + 2 * hlen + 2)
    {
        return (MBEDTLS_ERR_RSA_BAD_INPUT_DATA);
    }

    memset(output, 0, olen);

    *p++ = 0;

    /* Generate a random octet string seed */
    if ((ret = f_rng(p_rng, p, hlen)) != 0)
    {
        return (MBEDTLS_ERROR_ADD(MBEDTLS_ERR_RSA_RNG_FAILED, ret));
    }

    p += hlen;

    /* Construct DB */
    if ((ret = mbedtls_md(md_info, label, label_len, p)) != 0)
    {
        return (ret);
    }

    p += hlen;
    p += olen - 2 * hlen - 2 - ilen;
    *p++ = 1;

    if (ilen != 0)
    {
        memcpy(p, input, ilen);
    }

    mbedtls_md_init(&md_ctx);

    if ((ret = mbedtls_md_setup(&md_ctx, md_info, 0)) != 0)
    {
        goto exit;
    }

    /* maskedDB: Apply dbMask to DB */
    if ((ret = mgf_mask(output + hlen + 1, olen - hlen - 1, output + 1, hlen,
                        &md_ctx)) != 0)
    {
        goto exit;
    }

    /* maskedSeed: Apply seedMask to seed */
    if ((ret = mgf_mask(output + 1, hlen, output + hlen + 1, olen - hlen - 1,
                        &md_ctx)) != 0)
    {
        goto exit;
    }

exit:
    mbedtls_md_free(&md_ctx);

    if (ret != 0)
    {
        return (ret);
    }

