OpenNuvoton/M55M1BSP/Library/CryptoAccelerator/rsa_alt.c
    md_info = mbedtls_md_info_from_type((mbedtls_md_type_t) ctx->hash_id);

    if (md_info == NULL)
    {
        return (MBEDTLS_ERR_RSA_BAD_INPUT_DATA);
    }

    hlen = mbedtls_md_get_size(md_info);

    if (saltlen == MBEDTLS_RSA_SALT_LEN_ANY)
    {
        /* Calculate the largest possible salt length, up to the hash size.
         * Normally this is the hash length, which is the maximum salt length
         * according to FIPS 185-4 §5.5 (e) and common practice. If there is not
         * enough room, use the maximum salt length that fits. The constraint is
         * that the hash length plus the salt length plus 2 bytes must be at most
         * the key length. This complies with FIPS 186-4 §5.5 (e) and RFC 8017
         * (PKCS#1 v2.2) §9.1.1 step 3. */
        min_slen = hlen - 2;

        if (olen < hlen + min_slen + 2)
        {
            return (MBEDTLS_ERR_RSA_BAD_INPUT_DATA);
        }
        else if (olen >= hlen + hlen + 2)
        {
            slen = hlen;
        }
        else
        {
            slen = olen - hlen - 2;
        }
    }
    else if ((saltlen < 0) || (saltlen + hlen + 2 > olen))
    {
        return (MBEDTLS_ERR_RSA_BAD_INPUT_DATA);
    }
    else
    {
        slen = (size_t) saltlen;
    }

    memset(sig, 0, olen);

    /* Note: EMSA-PSS encoding is over the length of N - 1 bits */
    msb = mbedtls_mpi_bitlen(&ctx->N) - 1;
    p += olen - hlen - slen - 2;
    *p++ = 0x01;

    /* Generate salt of length slen in place in the encoded message */
    salt = p;

    if ((ret = f_rng(p_rng, salt, slen)) != 0)
    {
        return (MBEDTLS_ERROR_ADD(MBEDTLS_ERR_RSA_RNG_FAILED, ret));
    }

    p += slen;

    mbedtls_md_init(&md_ctx);

    if ((ret = mbedtls_md_setup(&md_ctx, md_info, 0)) != 0)
    {
        goto exit;
    }

    /* Generate H = Hash( M' ) */
    if ((ret = mbedtls_md_starts(&md_ctx)) != 0)
    {
        goto exit;
    }

    if ((ret = mbedtls_md_update(&md_ctx, p, 8)) != 0)
    {
        goto exit;
    }

    if ((ret = mbedtls_md_update(&md_ctx, hash, hashlen)) != 0)
    {
        goto exit;
    }

    if ((ret = mbedtls_md_update(&md_ctx, salt, slen)) != 0)
    {
        goto exit;
    }

    if ((ret = mbedtls_md_finish(&md_ctx, p)) != 0)
    {
        goto exit;
    }

    /* Compensate for boundary condition when applying mask */
    if (msb % 8 == 0)
    {
        offset = 1;
    }

    /* maskedDB: Apply dbMask to DB */
    if ((ret = mgf_mask(sig + offset, olen - hlen - 1 - offset, p, hlen,
                        &md_ctx)) != 0)
    {
        goto exit;
    }

    msb = mbedtls_mpi_bitlen(&ctx->N) - 1;
    sig[0] &= 0xFF >> (olen * 8 - msb);

    p += hlen;
    *p++ = 0xBC;

exit:
    mbedtls_md_free(&md_ctx);

    if (ret != 0)
    {
        return (ret);
    }

    return mbedtls_rsa_private(ctx, f_rng, p_rng, sig, sig);
}

/*
 * Implementation of the PKCS#1 v2.1 RSASSA-PSS-SIGN function with
 * the option to pass in the salt length.
 */
int mbedtls_rsa_rsassa_pss_sign_ext(mbedtls_rsa_context *ctx,
                                    int (*f_rng)(void *, unsigned char *, size_t),
                                    void *p_rng,
                                    mbedtls_md_type_t md_alg,
                                    unsigned int hashlen,
                                    const unsigned char *hash,
                                    int saltlen,
                                    unsigned char *sig)
{
    return rsa_rsassa_pss_sign(ctx, f_rng, p_rng, md_alg,
                               hashlen, hash, saltlen, sig);
}


/*
 * Implementation of the PKCS#1 v2.1 RSASSA-PSS-SIGN function
 */
int mbedtls_rsa_rsassa_pss_sign(mbedtls_rsa_context *ctx,
                                int (*f_rng)(void *, unsigned char *, size_t),
                                void *p_rng,
                                mbedtls_md_type_t md_alg,
                                unsigned int hashlen,
                                const unsigned char *hash,
                                unsigned char *sig)
{
    return rsa_rsassa_pss_sign(ctx, f_rng, p_rng, md_alg,
                               hashlen, hash, MBEDTLS_RSA_SALT_LEN_ANY, sig);
}
#endif /* MBEDTLS_PKCS1_V21 */

#if defined(MBEDTLS_PKCS1_V15)
/*
 * Implementation of the PKCS#1 v2.1 RSASSA-PKCS1-V1_5-SIGN function
 */

/* Construct a PKCS v1.5 encoding of a hashed message
 *
 * This is used both for signature generation and verification.
 *
 * Parameters:
 * - md_alg:  Identifies the hash algorithm used to generate the given hash;
 *            MBEDTLS_MD_NONE if raw data is signed.
 * - hashlen: Length of hash. Must match md_alg if that's not NONE.
 * - hash:    Buffer containing the hashed message or the raw data.
 * - dst_len: Length of the encoded message.
 * - dst:     Buffer to hold the encoded message.
 *
 * Assumptions:
 * - hash has size hashlen.
 * - dst points to a buffer of size at least dst_len.
 *
 */
static int rsa_rsassa_pkcs1_v15_encode(mbedtls_md_type_t md_alg,
                                       unsigned int hashlen,
                                       const unsigned char *hash,
                                       size_t dst_len,
                                       unsigned char *dst)
{
    size_t oid_size  = 0;
    size_t nb_pad    = dst_len;
    unsigned char *p = dst;
    const char *oid  = NULL;

    /* Are we signing hashed or raw data? */
    if (md_alg != MBEDTLS_MD_NONE)
    {
        const mbedtls_md_info_t *md_info = mbedtls_md_info_from_type(md_alg);

        if (md_info == NULL)
        {
            return (MBEDTLS_ERR_RSA_BAD_INPUT_DATA);
        }

        if (mbedtls_oid_get_oid_by_md(md_alg, &oid, &oid_size) != 0)
        {
            return (MBEDTLS_ERR_RSA_BAD_INPUT_DATA);
        }

        if (hashlen != mbedtls_md_get_size(md_info))
        {
            return (MBEDTLS_ERR_RSA_BAD_INPUT_DATA);
        }

        /* Double-check that 8 + hashlen + oid_size can be used as a
         * 1-byte ASN.1 length encoding and that there's no overflow. */
        if (8 + hashlen + oid_size  >= 0x80         ||
                10 + hashlen            <  hashlen      ||
                10 + hashlen + oid_size <  10 + hashlen)
        {
            return (MBEDTLS_ERR_RSA_BAD_INPUT_DATA);
        }

