OpenNuvoton/M55M1BSP/Library/CryptoAccelerator/rsa_alt.c
    ret = mbedtls_rsa_public(ctx, sig, buf);

    if (ret != 0)
    {
        return (ret);
    }

    p = buf;

    if (buf[siglen - 1] != 0xBC)
    {
        return (MBEDTLS_ERR_RSA_INVALID_PADDING);
    }

    if (md_alg != MBEDTLS_MD_NONE)
    {
        /* Gather length of hash to sign */
        md_info = mbedtls_md_info_from_type(md_alg);

        if (md_info == NULL)
        {
            return (MBEDTLS_ERR_RSA_BAD_INPUT_DATA);
        }

        if (hashlen != mbedtls_md_get_size(md_info))
        {
            return (MBEDTLS_ERR_RSA_BAD_INPUT_DATA);
        }
    }

    md_info = mbedtls_md_info_from_type(mgf1_hash_id);

    if (md_info == NULL)
    {
        return (MBEDTLS_ERR_RSA_BAD_INPUT_DATA);
    }

    hlen = mbedtls_md_get_size(md_info);

    memset(zeros, 0, 8);

    /*
     * Note: EMSA-PSS verification is over the length of N - 1 bits
     */
    msb = mbedtls_mpi_bitlen(&ctx->N) - 1;

    if (buf[0] >> (8 - siglen * 8 + msb))
    {
        return (MBEDTLS_ERR_RSA_BAD_INPUT_DATA);
    }

    /* Compensate for boundary condition when applying mask */
    if (msb % 8 == 0)
    {
        p++;
        siglen -= 1;
    }

    if (siglen < hlen + 2)
    {
        return (MBEDTLS_ERR_RSA_BAD_INPUT_DATA);
    }

    hash_start = p + siglen - hlen - 1;

    mbedtls_md_init(&md_ctx);

    if ((ret = mbedtls_md_setup(&md_ctx, md_info, 0)) != 0)
    {
        goto exit;
    }

    ret = mgf_mask(p, siglen - hlen - 1, hash_start, hlen, &md_ctx);

    if (ret != 0)
    {
        goto exit;
    }

    buf[0] &= 0xFF >> (siglen * 8 - msb);

    while (p < hash_start - 1 && *p == 0)
    {
        p++;
    }

    if (*p++ != 0x01)
    {
        ret = MBEDTLS_ERR_RSA_INVALID_PADDING;
        goto exit;
    }

    observed_salt_len = hash_start - p;

    if (expected_salt_len != MBEDTLS_RSA_SALT_LEN_ANY &&
            observed_salt_len != (size_t) expected_salt_len)
    {
        ret = MBEDTLS_ERR_RSA_INVALID_PADDING;
        goto exit;
    }

    /*
     * Generate H = Hash( M' )
     */
    ret = mbedtls_md_starts(&md_ctx);

    if (ret != 0)
    {
        goto exit;
    }

    ret = mbedtls_md_update(&md_ctx, zeros, 8);

    if (ret != 0)
    {
        goto exit;
    }

    ret = mbedtls_md_update(&md_ctx, hash, hashlen);

    if (ret != 0)
    {
        goto exit;
    }

    ret = mbedtls_md_update(&md_ctx, p, observed_salt_len);

    if (ret != 0)
    {
        goto exit;
    }

    ret = mbedtls_md_finish(&md_ctx, result);

    if (ret != 0)
    {
        goto exit;
    }

    if (memcmp(hash_start, result, hlen) != 0)
    {
        ret = MBEDTLS_ERR_RSA_VERIFY_FAILED;
        goto exit;
    }

exit:
    mbedtls_md_free(&md_ctx);

    return (ret);
}

/*
 * Simplified PKCS#1 v2.1 RSASSA-PSS-VERIFY function
 */
int mbedtls_rsa_rsassa_pss_verify(mbedtls_rsa_context *ctx,
                                  mbedtls_md_type_t md_alg,
                                  unsigned int hashlen,
                                  const unsigned char *hash,
                                  const unsigned char *sig)
{
    mbedtls_md_type_t mgf1_hash_id;
    RSA_VALIDATE_RET(ctx != NULL);
    RSA_VALIDATE_RET(sig != NULL);
    RSA_VALIDATE_RET((md_alg  == MBEDTLS_MD_NONE &&
                      hashlen == 0) ||
                     hash != NULL);

    mgf1_hash_id = (ctx->hash_id != MBEDTLS_MD_NONE)
                   ? (mbedtls_md_type_t) ctx->hash_id
                   : md_alg;

    return (mbedtls_rsa_rsassa_pss_verify_ext(ctx,
                                              md_alg, hashlen, hash,
                                              mgf1_hash_id,
                                              MBEDTLS_RSA_SALT_LEN_ANY,
                                              sig));

}
#endif /* MBEDTLS_PKCS1_V21 */

#if defined(MBEDTLS_PKCS1_V15)
/*
 * Implementation of the PKCS#1 v2.1 RSASSA-PKCS1-v1_5-VERIFY function
 */
int mbedtls_rsa_rsassa_pkcs1_v15_verify(mbedtls_rsa_context *ctx,
                                        mbedtls_md_type_t md_alg,
                                        unsigned int hashlen,
                                        const unsigned char *hash,
                                        const unsigned char *sig)
{
    int ret = 0;
    size_t sig_len;
    unsigned char *encoded = NULL, *encoded_expected = NULL;

    RSA_VALIDATE_RET(ctx != NULL);
    RSA_VALIDATE_RET(sig != NULL);
    RSA_VALIDATE_RET((md_alg  == MBEDTLS_MD_NONE &&
                      hashlen == 0) ||
                     hash != NULL);

    sig_len = ctx->len;

    /*
     * Prepare expected PKCS1 v1.5 encoding of hash.
     */

    if ((encoded          = mbedtls_calloc(1, sig_len)) == NULL ||
            (encoded_expected = mbedtls_calloc(1, sig_len)) == NULL)
    {
        ret = MBEDTLS_ERR_MPI_ALLOC_FAILED;
        goto cleanup;
    }

    if ((ret = rsa_rsassa_pkcs1_v15_encode(md_alg, hashlen, hash, sig_len,
                                           encoded_expected)) != 0)
    {
        goto cleanup;
    }

    /*
     * Apply RSA primitive to get what should be PKCS1 encoded hash.
     */

    ret = mbedtls_rsa_public(ctx, sig, encoded);

    if (ret != 0)
    {
        goto cleanup;
    }

    /*
     * Compare
     */

    if ((ret = mbedtls_safer_memcmp(encoded, encoded_expected,
                                    sig_len)) != 0)
    {
        ret = MBEDTLS_ERR_RSA_VERIFY_FAILED;
        goto cleanup;
    }

cleanup:

    if (encoded != NULL)
    {
        mbedtls_platform_zeroize(encoded, sig_len);
        mbedtls_free(encoded);
    }

    if (encoded_expected != NULL)
    {
        mbedtls_platform_zeroize(encoded_expected, sig_len);
        mbedtls_free(encoded_expected);
    }

    return (ret);
}
#endif /* MBEDTLS_PKCS1_V15 */

/*
 * Do an RSA operation and check the message digest
 */
int mbedtls_rsa_pkcs1_verify(mbedtls_rsa_context *ctx,
                             mbedtls_md_type_t md_alg,
                             unsigned int hashlen,
                             const unsigned char *hash,
                             const unsigned char *sig)
{
    RSA_VALIDATE_RET(ctx != NULL);
    RSA_VALIDATE_RET(sig != NULL);
    RSA_VALIDATE_RET((md_alg  == MBEDTLS_MD_NONE &&
                      hashlen == 0) ||
                     hash != NULL);

    switch (ctx->padding)
    {
#if defined(MBEDTLS_PKCS1_V15)

        case MBEDTLS_RSA_PKCS_V15:
            return mbedtls_rsa_rsassa_pkcs1_v15_verify(ctx, md_alg,
                                                       hashlen, hash, sig);
#endif

#if defined(MBEDTLS_PKCS1_V21)

        case MBEDTLS_RSA_PKCS_V21:
            return mbedtls_rsa_rsassa_pss_verify(ctx, md_alg,
                                                 hashlen, hash, sig);
#endif

        default:
            return (MBEDTLS_ERR_RSA_INVALID_PADDING);
    }
}

